{
  "Commands": {
    "help": {
      "format": "s!help [Optional: CommandName] [Optional: \"detailed\"]",
      "description": "Brings up this message.",
      "detailed": [ "Brings up a list of commands available if s!help is used.\n",
                    "If the optional arguments commandname and detailed are used\n",
                    "then a detailed description will appear for the command, such as\n",
                    "this one.\n",
                    "example: \"s!help help detailed\" will bring up this message!" ]
    },
    "points": {
      "format": "s!points",
      "description": "Sends you a message with your amount of points.",
      "detailed":  ["Tells you the amount of points you have on the current server."]
    },
    "blackjack": {
      "format": "s!blackjack [Required: Amount]",
      "description": "Plays a game of blackjack!",
      "detailed": [
        "Allows you to start a game of blackjack!\n",
        "The amount is the amount staked in the game\n",
        "Upon winning your amount is doubled, otherwise its the amount subtracted.\n",
        "When starting, you may either choose HIT or STAY\n",
        "You have one minute to choose before the game times out.\n",
        "If you choose HIT, and get an additional card until you STAY.\n",
        "If you or the house goes over a total value of 21, then the game ends."
      ]
    },
    "poll": {
      "options": {
        "-s": 0,
        "-t": 1
      },
      "format": "s!poll [Optional: -t (time < 10)] [Optional: -s] [Required: Question] [Required: Answers]",
      "description": "Starts a poll.",
      "detailed": [
        "Allows you to create a new poll!\n",
        "A question must be input as well as at least 2 answers.\n",
        "At max 4 answers are allowed in a poll.\n",
        "To enter an answer or a question longer than one word\n",
        "you may use quotations.\n",
        "Example: s!poll \"How are you?\" good bad",
        "This will start a poll with the question How are you? and give two answers",
        "-t [time]: Allows you to set the max time for a poll, default is 1 minute, max is 10 minutes",
        "-s: Hides poll results until the poll ends."
      ]
    }
  }
}
